parsing-tech-log/src/Catalogs/ИзвестныеСитуации/ИзвестныеСитуации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИзвестныеСитуации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Свойство</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантыЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вектор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТекстыВариантов</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вектор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/ИзвестныеСитуации/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
		хеширование.Добавить(Текст);
		ХешЗначения = Base64Строка(хеширование.ХешСумма);	
		
		Для каждого стр из ТекстыВариантов Цикл
			хеширование = Новый ХешированиеДанных(ХешФункция.SHA1);
			хеширование.Добавить(стр.Текст);
			стр.ХешЗначения = Base64Строка(хеширование.ХешСумма);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
